bobcmartin/microchip/AVRCore/hardware/1.00/variants/32pin-duseries/pins_arduino.h
  /* Use this for accessing PINnCTRL register */
  const uint8_t digital_pin_to_bit_position[] = { // *INDENT-OFF*
    #if CLOCK_SOURCE == 0 // PA0 used for external clock and crystal.
      PIN0_bp,//   0 PA0
    #else
      NOT_A_PIN,
    #endif
    #if CLOCK_SOURCE == 1   // PA1 also used for crystal
      NOT_A_PIN,
    #else // PA1 used for external crystal.
      PIN1_bp,//   1 PA1
    #endif    // *INDENT-ON*
    PIN2_bp,   //  2 PA2/SDA
    PIN3_bp,   //  3 PA3/SCL
    PIN4_bp,   //  4 PA4/MOSI
    PIN5_bp,   //  5 PA5/MISO
    PIN6_bp,   //  6 PA6/SCK
    PIN7_bp,   //  7 PA7/SS/CLKOUT/LED_BUILTIN
    PIN0_bp,   //  8 PC0/USART1_Tx
    PIN1_bp,   //  9 PC1/USART1_Rx
    PIN2_bp,   // 10 PC2
    PIN3_bp,   // 11 PC3
    NOT_A_PIN, // VDDIO2
    PIN1_bp,   // 13 PD1/AIN1
    PIN2_bp,   // 14 PD2/AIN2
    PIN3_bp,   // 15 PD3/AIN3
    PIN4_bp,   // 16 PD4/AIN4
    PIN5_bp,   // 17 PD5/AIN5
    PIN6_bp,   // 18 PD6/AIN6
    PIN7_bp,   // 19 PD7/AIN7/AREF
    PIN0_bp,   // 20 PF0/USART2_Tx/TOSC1
    PIN1_bp,   // 21 PF1/USART2_Rx/TOSC2
    PIN2_bp,   // 22 PF2
    PIN3_bp,   // 23 PF3
    PIN4_bp,   // 24 PF4
    PIN5_bp,   // 25 PF5
    PIN6_bp,   // 26 PF6 RESET
    PIN7_bp    // 27 PD7 UPDI
  };

  const uint8_t digital_pin_to_bit_mask[] = { // *INDENT-OFF*
    #if CLOCK_SOURCE == 0 // PA0 used for external clock and crystal.
      PIN0_bm,//   0 PA0
    #else
      NOT_A_PIN,
    #endif
    #if CLOCK_SOURCE == 1   // PA1 also used for crystal
      NOT_A_PIN,
    #else // PA1 used for external crystal.
      PIN1_bm,//   1 PA1
    #endif    // *INDENT-ON*
    PIN2_bm,   //  2 PA2/SDA
    PIN3_bm,   //  3 PA3/SCL
    PIN4_bm,   //  4 PA4/MOSI
    PIN5_bm,   //  5 PA5/MISO
    PIN6_bm,   //  6 PA6/SCK
    PIN7_bm,   //  7 PA7/SS/CLKOUT/LED_BUILTIN
    PIN0_bm,   //  8 PC0/USART1_Tx
    PIN1_bm,   //  9 PC1/USART1_Rx
    PIN2_bm,   // 10 PC2
    PIN3_bm,   // 11 PC3
    NOT_A_PIN, // VDDIO2
    PIN1_bm,   // 13 PD1/AIN1
    PIN2_bm,   // 14 PD2/AIN2
    PIN3_bm,   // 15 PD3/AIN3
    PIN4_bm,   // 16 PD4/AIN4
    PIN5_bm,   // 17 PD5/AIN5
    PIN6_bm,   // 18 PD6/AIN6
    PIN7_bm,   // 19 PD7/AIN7/AREF
    PIN0_bm,   // 20 PF0/TOSC1
    PIN1_bm,   // 21 PF1/TOSC2
    PIN2_bm,   // 22 PF2
    PIN3_bm,   // 23 PF3
    PIN4_bm,   // 24 PF4
    PIN5_bm,   // 25 PF5
    PIN6_bm,   // 26 PF6 RESET
    PIN7_bm    // 27 PF7 UPDI
  };

  const uint8_t digital_pin_to_timer[] = {
    NOT_ON_TIMER, //  0 PA0 TCA0 ALT0
    NOT_ON_TIMER, //  1 PA1 TCA0 ALT0
    TIMERB0,      //  2 PA2 TCA0 ALT0/TCB WO DEFAULT (default)
    TIMERB1,      //  3 PA3 TCA0 ALT0/TCB WO DEFAULT (default)
    TIMERD0_0WOA, //  4 PA4 TCA0 ALT0/TCD WOA DEFAULT+ALT4 (default)
    TIMERD0_0WOA, //  5 PA5 TCA0 ALT0/TCD WOB DEFAULT+ALT4 (default)
    TIMERD0_0WOA, //  6 PA6 TCD WOC mirrors WOA DEFAULT (default)
    TIMERD0_0WOA, //  7 PA7 TCD WOD mirrors WOB DEFAULT (default)
    NOT_ON_TIMER,,      //  8 PC0 TCA0 ALT2/TCB2 (TCB2 used for millis, not PWM)
    NOT_ON_TIMER, //  9 PC1 TCA0 ALT2
    NOT_ON_TIMER, // 10 PC2 TCA0 ALT2
    NOT_ON_TIMER, // 11 PC3 TCA0 ALT2
    NOT_ON_TIMER, // VDDIO2
    NOT_ON_TIMER, // 13 PD1 TCA0 ALT3
    NOT_ON_TIMER, // 14 PD2 TCA0 ALT3
    NOT_ON_TIMER, // 15 PD3 TCA0 ALT3
    TIMERD0_4WOC, // 16 PD4 TCA0 ALT3/TCD WOC mirrors WOA ALT4
    TIMERD0_4WOD, // 17 PD5 TCA0 ALT3/TCD WOD mirrors WOB ALT4
    DACOUT,       // 18 PD6 DAC0 output
    NOT_ON_TIMER, // 19 PD7
    TIMERD0_2WOA, // 20 PF0 TCA0 WO0 ALT5 (default)/TCD WOA ALT2
    TIMERD0_2WOB, // 21 PF1 TCA0 WO1 ALT5 (default)/TCD WOB ALT2
    TIMERD0_2WOC, // 22 PF2 TCA0 WO2 ALT5 (default)/TCD WOC mirrors WOA ALT2
    TIMERD0_2WOD, // 23 PF3 TCA0 WO3 ALT5 (default)/TCD WOD mirrors WOB ALT2
    NOT_ON_TIMER, // 24 PF4 TCA0 WO4 ALT5 (default)
    NOT_ON_TIMER, // 25 PF5 TCA0 WO5 ALT5 (default)
    NOT_ON_TIMER, // 26 PF6 RESET
    NOT_ON_TIMER  // 27 PF7 UPDI
  };

#endif
// These are used for CI testing. They should *not* *ever* be used except for CI-testing.
// For CI testing we often need to have known usable pins, that won't generate compile errors
// (we don't care whether it would actually do anything useful, we are concerned only with compiling successfully)
#define __EXAMPLE_DIGITAL_PIN0 PIN_PA3
#define __EXAMPLE_DIGITAL_PIN1 PIN_PA4
#define __EXAMPLE_DIGITAL_PIN2 PIN_PA5
#define __EXAMPLE_DIGITAL_PIN3 PIN_PA6
#define __EXAMPLE_ANALOG_PIN0 PIN_PA4
#define __EXAMPLE_ANALOG_PIN1 PIN_PA5
#define __EXAMPLE_ANALOG_PIN2 PIN_PA6
#define __EXAMPLE_ANALOG_PIN3 PIN_PA7
#define __EXAMPLE_TCA_PWM_PIN PIN_PF0
#define __EXAMPLE_TCB_PWM_PIN PIN_PA2
#define __EXAMPLE_TCD_PWM_PIN PIN_PA7
#endif
